ARMmbed/mbed-os/features/unsupported/USBDevice/targets/TARGET_NUVOTON/TARGET_M480/USBHAL_M480.cpp
        uint32_t gintsts_epx = (u32IntSts >> 18) & 0x3F;
        uint32_t ep_hw_index = 2;
        while (gintsts_epx) {
            if (gintsts_epx & 0x01) {
                uint32_t ep_status = (USBD_GET_EP_FLAG() >> (ep_hw_index * 3 + 8)) & 0x7;
                /* Clear event flag */
                USBD_CLR_INT_FLAG(1 << (ep_hw_index + 16));

                if (ep_status == 0x02 || ep_status == 0x06 || (ep_status == 0x07 && NU_EPH2EPL(ep_hw_index) == 3)) { //RX
                    if (ep_status == 0x07) {
                        SOF(frame_cnt++);
                    }
                    if ((instance->*(epCallback[ep_hw_index - 2]))()) {

                    }
                    USBD_SET_PAYLOAD_LEN(ep_hw_index, s_ep_mxp[NU_EPH2EPL(ep_hw_index)]);
                } else if (ep_status == 0x00 || ep_status == 0x07) { //TX
                    s_ep_compl &= ~(1 << (NU_EPH2EPL(ep_hw_index)));
                    if ((instance->*(epCallback[ep_hw_index - 2]))()) {
                    }
                }
            }

            gintsts_epx = gintsts_epx >> 1;
            ep_hw_index++;
        }
    }
}
#else

static volatile uint32_t s_ep_compl = 0;
static volatile uint32_t s_ep_buf_ind = 0;
static volatile uint8_t s_usb_addr = 0;
static volatile S_HSUSBD_CMD_T s_setup;
static volatile uint16_t s_ctrlin_packetsize;
static uint8_t *g_usbd_CtrlInPointer = 0;
static uint32_t g_usbd_CtrlMaxPktSize = 64;
static volatile uint32_t g_usbd_CtrlInSize;
static uint32_t g_usbd_ShortPacket = 0;
//static uint32_t gEpRead = 0;
static uint32_t gEpReadCnt = 0;

void HSUSBD_CtrlInput(void)
{
    unsigned volatile i;
    uint32_t volatile count;

    // Process remained data
    if (g_usbd_CtrlInSize >= g_usbd_CtrlMaxPktSize) {
        // Data size > MXPLD
        for (i = 0; i < (g_usbd_CtrlMaxPktSize >> 2); i++, g_usbd_CtrlInPointer += 4) {
            HSUSBD->CEPDAT = *(uint32_t *)g_usbd_CtrlInPointer;
        }
        HSUSBD_START_CEP_IN(g_usbd_CtrlMaxPktSize);
        g_usbd_CtrlInSize -= g_usbd_CtrlMaxPktSize;
    } else {
        // Data size <= MXPLD
        for (i = 0; i < (g_usbd_CtrlInSize >> 2); i++, g_usbd_CtrlInPointer += 4) {
            HSUSBD->CEPDAT = *(uint32_t *)g_usbd_CtrlInPointer;
        }

        count = g_usbd_CtrlInSize % 4;
        for (i = 0; i < count; i++) {
            HSUSBD->CEPDAT_BYTE = *(uint8_t *)(g_usbd_CtrlInPointer + i);
        }

        HSUSBD_START_CEP_IN(g_usbd_CtrlInSize);
        g_usbd_CtrlInPointer = 0;
        g_usbd_CtrlInSize = 0;
    }
}

USBHAL::USBHAL(void)
{
    SYS_UnlockReg();

    s_ep_buf_ind = 0;

    memset(epCallback, 0x00, sizeof(epCallback));
    epCallback[0] = &USBHAL::EP1_OUT_callback;
    epCallback[1] = &USBHAL::EP2_IN_callback;
    epCallback[2] = &USBHAL::EP3_OUT_callback;
    epCallback[3] = &USBHAL::EP4_IN_callback;
    epCallback[4] = &USBHAL::EP5_OUT_callback;
    epCallback[5] = &USBHAL::EP6_IN_callback;
    epCallback[6] = &USBHAL::EP7_OUT_callback;
    epCallback[7] = &USBHAL::EP8_IN_callback;
    epCallback[8] = &USBHAL::EP9_OUT_callback;
    epCallback[9] = &USBHAL::EP10_IN_callback;
    epCallback[10] = &USBHAL::EP11_OUT_callback;
    epCallback[11] = &USBHAL::EP12_IN_callback;

    instance = this;

    /* Configure HSUSB to Device mode */
    SYS->USBPHY = (SYS->USBPHY & ~SYS_USBPHY_HSUSBROLE_Msk) | SYS_USBPHY_HSUSBROLE_STD_USBD;
    /* Enable HSUSB PHY */
    SYS->USBPHY = (SYS->USBPHY & ~(SYS_USBPHY_HSUSBEN_Msk | SYS_USBPHY_HSUSBACT_Msk)) | SYS_USBPHY_HSUSBEN_Msk;
    /* Delay >10 us and then switch HSUSB PHY from reset state to active state */
    wait_us(10);
    SYS->USBPHY |= SYS_USBPHY_HSUSBACT_Msk;

    /* Enable USBD module clock */
    CLK_EnableModuleClock(HSUSBD_MODULE);

    /* Enable USB PHY and wait for it ready */
    HSUSBD_ENABLE_PHY();
    while (1) {
        HSUSBD->EP[0].EPMPS = 0x20;
        if (HSUSBD->EP[0].EPMPS == 0x20) {
            break;
        }
    }

    /* Force to full-speed */
    HSUSBD->OPER = 0;//USBD_OPER_HISPDEN_Msk;

    /* Set SE0 (disconnect) */
    HSUSBD_SET_SE0();

    NVIC_SetVector(USBD20_IRQn, (uint32_t) &_usbisr);
    NVIC_EnableIRQ(USBD20_IRQn);
}

USBHAL::~USBHAL(void)
{
    NVIC_DisableIRQ(USBD20_IRQn);
    HSUSBD_SET_SE0();
    HSUSBD_DISABLE_PHY();
}

void USBHAL::connect(void)
{
    HSUSBD_ResetDMA();
    HSUSBD_SET_ADDR(0);

    /**
      * Control Transfer Packet Size Constraints
      * low-speed: 8
      * full-speed: 8, 16, 32, 64
      * high-speed: 64
      */
    /* Control endpoint */
    HSUSBD_SetEpBufAddr(CEP, s_ep_buf_ind, MAX_PACKET_SIZE_EP0);
    s_ep_buf_ind = MAX_PACKET_SIZE_EP0;

    /* Enable USB/CEP interrupt */
    HSUSBD_ENABLE_USB_INT(HSUSBD_GINTEN_USBIEN_Msk | HSUSBD_GINTEN_CEPIEN_Msk);
    HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);

    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(
        HSUSBD_BUSINTEN_DMADONEIEN_Msk |
        HSUSBD_BUSINTEN_RESUMEIEN_Msk |
        HSUSBD_BUSINTEN_RSTIEN_Msk |
        HSUSBD_BUSINTEN_VBUSDETIEN_Msk |
        HSUSBD_BUSINTEN_SOFIEN_Msk
    );

    /* Clear SE0 (connect) */
    HSUSBD_CLR_SE0();
}

void USBHAL::disconnect(void)
{
    /* Set SE0 (disconnect) */
    HSUSBD_SET_SE0();
}

void USBHAL::configureDevice(void)
{
    /**
     * In USBDevice.cpp > USBDevice::requestSetConfiguration, configureDevice() is called after realiseEndpoint() (in USBCallback_setConfiguration()).
     * So we have the following USB buffer management policy:
     *  1. Allocate for CEP on connect().
     *  2. Allocate for EPX in realiseEndpoint().
     *  3. Deallocate all except for CEP in unconfigureDevice().
     */
}

void USBHAL::unconfigureDevice(void)
{
    s_ep_buf_ind = MAX_PACKET_SIZE_EP0;
}

void USBHAL::setAddress(uint8_t address)
{
    // NOTE: Delay address setting; otherwise, USB controller won't ack.
    s_usb_addr = address;
}

void USBHAL::remoteWakeup(void)
{
    HSUSBD->OPER |= HSUSBD_OPER_RESUMEEN_Msk;
}

bool USBHAL::realiseEndpoint(uint8_t endpoint, uint32_t maxPacket, uint32_t options)
{
    uint32_t ep_type;
    uint32_t ep_hw_index = NU_EP2EPH(endpoint);

    HSUSBD_SetEpBufAddr(ep_hw_index, s_ep_buf_ind, maxPacket);
    s_ep_buf_ind += maxPacket;
    HSUSBD_SET_MAX_PAYLOAD(ep_hw_index, maxPacket);

    switch (NU_EP2EPL(endpoint)) {
        case 1:
        case 2:
            ep_type = HSUSBD_EP_CFG_TYPE_INT;
            break;

        case 3:
        case 4:
            ep_type = HSUSBD_EP_CFG_TYPE_ISO;
            break;

        default:
            ep_type = HSUSBD_EP_CFG_TYPE_BULK;
    }
    uint32_t ep_dir = (NU_EP_DIR(endpoint) == NU_EP_DIR_IN) ? HSUSBD_EP_CFG_DIR_IN : HSUSBD_EP_CFG_DIR_OUT;
    HSUSBD_ConfigEp(ep_hw_index, NU_EP2EPL(endpoint), ep_type, ep_dir);

