ARMmbed/mbed-os/features/unsupported/USBDevice/targets/TARGET_NUVOTON/TARGET_M480/USBHAL_M480.cpp
    /* Enable USB/EPX interrupt */
    // NOTE: Require USBD_GINTEN_EPAIE_Pos, USBD_GINTEN_EPBIE_Pos, ... USBD_GINTEN_EPLIE_Pos to be consecutive.
    HSUSBD_ENABLE_USB_INT(HSUSBD->GINTEN | HSUSBD_GINTEN_USBIEN_Msk |
                          HSUSBD_GINTEN_CEPIEN_Msk |
                          1 << (ep_hw_index + HSUSBD_GINTEN_EPAIEN_Pos));  // Added USB/EPX interrupt

    if (ep_dir == 0) {
        HSUSBD_ENABLE_EP_INT(ep_hw_index, HSUSBD_EPINTEN_RXPKIEN_Msk);
    } else {
        HSUSBD_ENABLE_EP_INT(ep_hw_index, HSUSBD_EPINTEN_TXPKIEN_Msk);
    }
    return true;
}

void USBHAL::EP0setup(uint8_t *buffer)
{
    uint32_t sz;
    endpointReadResult(EP0OUT, buffer, &sz);
}

void USBHAL::EP0read(void)
{
    if (s_setup.wLength && !(s_setup.bmRequestType & 0x80)) {
        // Control OUT
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_RXPKIEN_Msk);
    } else {
        // Status stage
        HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
        HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
    }
}

void USBHAL::EP0readStage(void)
{
    // N/A
}

uint32_t USBHAL::EP0getReadResult(uint8_t *buffer)
{
    uint32_t i;
    uint32_t ceprxcnt = HSUSBD->CEPRXCNT;
    for (i = 0; i < ceprxcnt; i ++) {
        *buffer ++ = HSUSBD->CEPDAT_BYTE;
    }
    return ceprxcnt;
}

void USBHAL::EP0write(uint8_t *buffer, uint32_t size)
{
    if (buffer && size) {
        g_usbd_CtrlInPointer = buffer;
        g_usbd_CtrlInSize = size;
        HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk);
    } else {
        /* Status stage */
        s_ctrlin_packetsize = 0;
        HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
        HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
    }
}

void USBHAL::EP0getWriteResult(void)
{
    // N/A
}

void USBHAL::EP0stall(void)
{
    stallEndpoint(EP0OUT);
}

EP_STATUS USBHAL::endpointRead(uint8_t endpoint, uint32_t maximumSize)
{
    return EP_PENDING;
}

EP_STATUS USBHAL::endpointReadResult(uint8_t endpoint, uint8_t *buffer, uint32_t *bytesRead)  //spcheng
{
    if (endpoint == EP0OUT) {
        if (buffer) {
            *((uint16_t *)(buffer + 0)) = (uint16_t) HSUSBD->SETUP1_0;
            *((uint16_t *)(buffer + 2)) = (uint16_t) HSUSBD->SETUP3_2;
            *((uint16_t *)(buffer + 4)) = (uint16_t) HSUSBD->SETUP5_4;
            *((uint16_t *)(buffer + 6)) = (uint16_t) HSUSBD->SETUP7_6;
        }

        s_setup.bmRequestType = (uint8_t)(HSUSBD->SETUP1_0 & 0xff);
        s_setup.bRequest = (int8_t)(HSUSBD->SETUP1_0 >> 8) & 0xff;
        s_setup.wValue = (uint16_t) HSUSBD->SETUP3_2;
        s_setup.wIndex = (uint16_t) HSUSBD->SETUP5_4;
        s_setup.wLength = (uint16_t) HSUSBD->SETUP7_6;
    } else {
        if (!(s_ep_compl & (1 << NU_EP2EPL(endpoint)))) {
            while (1) {
                if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk)) {
                    break;
                } else if (!HSUSBD_IS_ATTACHED()) {
                    break;
                }
            }
            gEpReadCnt = HSUSBD_GET_EP_DATA_COUNT(NU_EP2EPH(endpoint));
            if (gEpReadCnt == 0) {
                *bytesRead = 0;
                return EP_COMPLETED;
            }
            s_ep_compl |= (1 << NU_EP2EPL(endpoint));
            HSUSBD_SET_DMA_LEN(gEpReadCnt);
            HSUSBD_SET_DMA_ADDR((uint32_t)buffer);
            HSUSBD_SET_DMA_WRITE(NU_EP2EPL(endpoint));
            HSUSBD_ENABLE_DMA();
            return EP_PENDING;;

        } else {
            if ((HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk)) {
                return EP_PENDING;
            };

            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_DMADONEIF_Msk);
            s_ep_compl &= ~(1 << NU_EP2EPL(endpoint));
            *bytesRead = gEpReadCnt;
        }
    }
    return EP_COMPLETED;
}


uint32_t USBHAL::endpointReadcore(uint8_t endpoint, uint8_t *buffer)
{
    return 0;
}

EP_STATUS USBHAL::endpointWrite(uint8_t endpoint, uint8_t *data, uint32_t size)
{
    uint32_t ep_logic_index = NU_EP2EPL(endpoint);
    if (ep_logic_index == 0) {
        return EP_INVALID;
    } else {
        uint32_t ep_hw_index = NU_EP2EPH(endpoint);
        uint32_t mps = HSUSBD_GET_EP_MAX_PAYLOAD(ep_hw_index);
        if (size > mps) {
            return EP_INVALID;
        }
        if (size < mps) {
            g_usbd_ShortPacket = 1;
        }
        if (!(s_ep_compl & (1 << NU_EP2EPL(endpoint)))) {
            s_ep_compl |= (1 << ep_logic_index);

            while (1) {
                if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk)) {
                    break;
                } else if (!HSUSBD_IS_ATTACHED()) {
                    break;
                }
            }
            HSUSBD_SET_DMA_LEN(size);
            HSUSBD_SET_DMA_ADDR((uint32_t)data);
            HSUSBD_SET_DMA_READ(ep_logic_index);
            HSUSBD_ENABLE_DMA();
        }
    }
    return EP_PENDING;
}

EP_STATUS USBHAL::endpointWriteResult(uint8_t endpoint)
{
    if (!(s_ep_compl & (1 << NU_EP2EPL(endpoint)))) {
        return EP_COMPLETED;
    } else {
        if ((HSUSBD_GET_EP_DATA_COUNT(NU_EP2EPH(endpoint))) == 0 && !(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk)) {
            s_ep_compl &= ~(s_ep_compl & (1 << NU_EP2EPL(endpoint)));
            return EP_COMPLETED;
        }
    }
    return EP_PENDING;
}

void USBHAL::stallEndpoint(uint8_t endpoint)
{
    uint32_t ep_hw_index = NU_EP2EPH(endpoint);
    if (ep_hw_index >= NUMBER_OF_PHYSICAL_ENDPOINTS) {
        return;
    }
    HSUSBD_SetStall(ep_hw_index);
}

void USBHAL::unstallEndpoint(uint8_t endpoint)
{
    uint32_t ep_hw_index = NU_EP2EPH(endpoint);
    if (ep_hw_index >= NUMBER_OF_PHYSICAL_ENDPOINTS) {
        return;
    }
    HSUSBD_ClearStall(ep_hw_index);
}

bool USBHAL::getEndpointStallState(uint8_t endpoint)
{
    uint32_t ep_hw_index = NU_EP2EPH(endpoint);
    if (ep_hw_index >= NUMBER_OF_PHYSICAL_ENDPOINTS) {
        return false;
    }
    return HSUSBD_GetStall(ep_hw_index) ? 1 : 0;
}

